spec/fixtures/stripe_webhook-customer.subscription.created.json

{
  "id": "evt_0Qv3uNm0T0GBfX0viWMFYvVg",
  "object": "event",
  "api_version": "2025-01-27.acacia",
  "created": 1740173836,
  "data": {
    "object": {
      "id": "sub_0Qv3uJm0T0GBfX0v77OTe6ii",
      "object": "subscription",
      "application": null,
      "application_fee_percent": null,
      "automatic_tax": {
        "disabled_reason": null,
        "enabled": false,
        "liability": null
      },
      "billing_cycle_anchor": 1740173835,
      "billing_cycle_anchor_config": null,
      "billing_thresholds": null,
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "cancellation_details": {
        "comment": null,
        "feedback": null,
        "reason": null
      },
      "collection_method": "charge_automatically",
      "created": 1740173835,
      "currency": "usd",
      "current_period_end": 1742593035,
      "current_period_start": 1740173835,
      "customer": "cus_RohIc4uZhMPzxN",
      "days_until_due": null,
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [
      ],
      "description": null,
      "discount": null,
      "discounts": [
      ],
      "ended_at": null,
      "invoice_settings": {
        "account_tax_ids": null,
        "issuer": {
          "type": "self"
        }
      },
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_RohIR483d0K1ok",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": 1740173836,
            "discounts": [
            ],
            "metadata": {
            },
            "plan": {
              "id": "price_0Qs5s1m0T0GBfX0visCJi4lq",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 999,
              "amount_decimal": "999",
              "billing_scheme": "per_unit",
              "created": 1739466397,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "meter": null,
              "nickname": null,
              "product": "prod_Rld8cRL9WZDT4c",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "id": "price_0Qs5s1m0T0GBfX0visCJi4lq",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1739466397,
              "currency": "usd",
              "custom_unit_amount": null,
              "livemode": false,
              "lookup_key": null,
              "metadata": {
              },
              "nickname": null,
              "product": "prod_Rld8cRL9WZDT4c",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "meter": null,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tax_behavior": "unspecified",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 999,
              "unit_amount_decimal": "999"
            },
            "quantity": 1,
            "subscription": "sub_0Qv3uJm0T0GBfX0v77OTe6ii",
            "tax_rates": [
            ]
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_0Qv3uJm0T0GBfX0v77OTe6ii"
      },
      "latest_invoice": "in_0Qv3uJm0T0GBfX0vXLZmSpZb",
      "livemode": false,
      "metadata": {
      },
      "next_pending_invoice_item_invoice": null,
      "on_behalf_of": null,
      "pause_collection": null,
      "payment_settings": {
        "payment_method_options": {
          "acss_debit": null,
          "bancontact": null,
          "card": {
            "network": null,
            "request_three_d_secure": "automatic"
          },
          "customer_balance": null,
          "konbini": null,
          "sepa_debit": null,
          "us_bank_account": null
        },
        "payment_method_types": null,
        "save_default_payment_method": "off"
      },
      "pending_invoice_item_interval": null,
      "pending_setup_intent": null,
      "pending_update": null,
      "plan": {
        "id": "price_0Qs5s1m0T0GBfX0visCJi4lq",
        "object": "plan",
        "active": true,
        "aggregate_usage": null,
        "amount": 999,
        "amount_decimal": "999",
        "billing_scheme": "per_unit",
        "created": 1739466397,
        "currency": "usd",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {
        },
        "meter": null,
        "nickname": null,
        "product": "prod_Rld8cRL9WZDT4c",
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "schedule": null,
      "start_date": 1740173835,
      "status": "incomplete",
      "test_clock": null,
      "transfer_data": null,
      "trial_end": null,
      "trial_settings": {
        "end_behavior": {
          "missing_payment_method": "create_invoice"
        }
      },
      "trial_start": null
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": "req_yqOhGjYWV5WqLh",
    "idempotency_key": "4b6c27f6-f965-422c-8f47-5e8a20c1ffd4"
  },
  "type": "customer.subscription.created"
}
